{
  "format": "layers-model",
  "generatedBy": "keras v3.13.2",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "modelTopology": {
    "keras_version": "2.15.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 5000],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "input_layer"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "dtype": "float32",
              "units": 512,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}},
              "bias_initializer": {"class_name": "Zeros", "config": {}},
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization",
              "trainable": true,
              "dtype": "float32",
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {"class_name": "Zeros", "config": {}},
              "gamma_initializer": {"class_name": "Ones", "config": {}},
              "moving_mean_initializer": {"class_name": "Zeros", "config": {}},
              "moving_variance_initializer": {"class_name": "Ones", "config": {}},
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.5,
              "seed": null,
              "noise_shape": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": "float32",
              "units": 256,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}},
              "bias_initializer": {"class_name": "Zeros", "config": {}},
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_1",
              "trainable": true,
              "dtype": "float32",
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {"class_name": "Zeros", "config": {}},
              "gamma_initializer": {"class_name": "Ones", "config": {}},
              "moving_mean_initializer": {"class_name": "Zeros", "config": {}},
              "moving_variance_initializer": {"class_name": "Ones", "config": {}},
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_1",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.4,
              "seed": null,
              "noise_shape": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_2",
              "trainable": true,
              "dtype": "float32",
              "units": 128,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}},
              "bias_initializer": {"class_name": "Zeros", "config": {}},
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_2",
              "trainable": true,
              "dtype": "float32",
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {"class_name": "Zeros", "config": {}},
              "gamma_initializer": {"class_name": "Ones", "config": {}},
              "moving_mean_initializer": {"class_name": "Zeros", "config": {}},
              "moving_variance_initializer": {"class_name": "Ones", "config": {}},
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_2",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.3,
              "seed": null,
              "noise_shape": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_3",
              "trainable": true,
              "dtype": "float32",
              "units": 24,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}},
              "bias_initializer": {"class_name": "Zeros", "config": {}},
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      }
    },
    "training_config": {
      "loss": "categorical_crossentropy",
      "metrics": ["accuracy"],
      "weighted_metrics": null,
      "loss_weights": null,
      "optimizer_config": {
        "class_name": "Adam",
        "config": {
          "name": "adam",
          "learning_rate": 0.0002500000118743628,
          "beta_1": 0.9,
          "beta_2": 0.999,
          "epsilon": 1e-07,
          "amsgrad": false
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"],
      "weights": [
        {"name": "batch_normalization/gamma", "shape": [512], "dtype": "float32"},
        {"name": "batch_normalization/beta", "shape": [512], "dtype": "float32"},
        {"name": "batch_normalization/moving_mean", "shape": [512], "dtype": "float32"},
        {"name": "batch_normalization/moving_variance", "shape": [512], "dtype": "float32"},
        {"name": "batch_normalization_1/gamma", "shape": [256], "dtype": "float32"},
        {"name": "batch_normalization_1/beta", "shape": [256], "dtype": "float32"},
        {"name": "batch_normalization_1/moving_mean", "shape": [256], "dtype": "float32"},
        {"name": "batch_normalization_1/moving_variance", "shape": [256], "dtype": "float32"},
        {"name": "batch_normalization_2/gamma", "shape": [128], "dtype": "float32"},
        {"name": "batch_normalization_2/beta", "shape": [128], "dtype": "float32"},
        {"name": "batch_normalization_2/moving_mean", "shape": [128], "dtype": "float32"},
        {"name": "batch_normalization_2/moving_variance", "shape": [128], "dtype": "float32"},
        {"name": "dense/kernel", "shape": [5000, 512], "dtype": "float32"},
        {"name": "dense/bias", "shape": [512], "dtype": "float32"},
        {"name": "dense_1/kernel", "shape": [512, 256], "dtype": "float32"},
        {"name": "dense_1/bias", "shape": [256], "dtype": "float32"},
        {"name": "dense_2/kernel", "shape": [256, 128], "dtype": "float32"},
        {"name": "dense_2/bias", "shape": [128], "dtype": "float32"},
        {"name": "dense_3/kernel", "shape": [128, 24], "dtype": "float32"},
        {"name": "dense_3/bias", "shape": [24], "dtype": "float32"}
      ]
    }
  ]
}