{"hr": 2217, "administrator": 235, "marketing": 2781, "associate": 444, "summary": 4479, "dedicated": 1290, "customer": 1205, "service": 4117, "manager": 2744, "15": 38, "years": 4993, "hospitality": 2201, "management": 2711, "builder": 636, "leader": 2550, "focused": 1939, "teams": 4575, "shared": 4153, "enthusiastic": 1661, "commitment": 900, "highlights": 2168, "satisfaction": 4009, "team": 4562, "savvy": 4014, "conflict": 1010, "resolution": 3862, "techniques": 4586, "training": 4683, "development": 1381, "skilled": 4196, "multi": 2993, "tasker": 4546, "client": 828, "relations": 3790, "specialist": 4271, "accomplishments": 126, "missouri": 2940, "supervisor": 4498, "certification": 753, "certified": 755, "loyalty": 2669, "segment": 4075, "worldwide": 4976, "general": 2027, "accomplished": 125, "trainer": 4681, "cross": 1183, "server": 4114, "systems": 4529, "completed": 951, "courses": 1143, "seminars": 4093, "sales": 3963, "strategies": 4416, "inventory": 2422, "control": 1080, "loss": 2659, "prevention": 3475, "safety": 3954, "time": 4644, "leadership": 2552, "performance": 3305, "assessment": 422, "dec": 1280, "current": 1198, "develop": 1366, "policies": 3401, "coordinates": 1096, "activities": 188, "employment": 1602, "compensation": 937, "labor": 2514, "benefits": 566, "employee": 1590, "services": 4136, "prepares": 3457, "notices": 3071, "related": 3786, "documentation": 1476, "records": 3745, "plans": 3382, "participation": 3258, "insurance": 2366, "plan": 3375, "personnel": 3328, "transactions": 4694, "hires": 2181, "promotions": 3592, "transfers": 4697, "reviews": 3915, "terminations": 4611, "statistics": 4390, "government": 2064, "reporting": 3823, "appropriate": 373, "issues": 2449, "programs": 3568, "life": 2607, "health": 2136, "dental": 1319, "vacation": 4799, "leave": 2572, "absence": 111, "assistance": 435, "designed": 1342, "created": 1157, "collateral": 876, "meetings": 2867, "trade": 4670, "shows": 4174, "executives": 1752, "managed": 2707, "house": 2212, "advertising": 253, "program": 3563, "consisting": 1024, "print": 3486, "media": 2844, "pieces": 3361, "assisted": 440, "complete": 950, "design": 1335, "launch": 2538, "website": 4900, "months": 2970, "official": 3131, "page": 3235, "facebook": 1814, "facilitate": 1817, "interaction": 2381, "customers": 1231, "analyzed": 325, "ratings": 3706, "programming": 3567, "features": 1851, "competitors": 945, "evaluate": 1697, "effectiveness": 1558, "advanced": 250, "medical": 2851, "claims": 810, "analyst": 317, "mar": 2766, "reviewed": 3913, "bills": 583, "accuracy": 162, "treatments": 4714, "tests": 4621, "hospital": 2200, "prior": 3491, "trained": 4678, "interpret": 2407, "codes": 865, "icd": 2231, "cpt": 1154, "terminology": 4612, "used": 4784, "billing": 580, "fully": 1995, "understand": 4743, "paperwork": 3244, "submitted": 4464, "healthcare": 2143, "providers": 3632, "required": 3841, "organizational": 3180, "analytical": 320, "computer": 970, "knowledge": 2502, "procedures": 3510, "standards": 4325, "data": 1248, "analysis": 314, "laws": 2543, "regarding": 3766, "assistant": 436, "jun": 2482, "performed": 3310, "duties": 1516, "including": 2277, "limited": 2615, "budgeting": 630, "financial": 1883, "accounting": 143, "human": 2223, "resources": 3876, "payroll": 3288, "purchasing": 3655, "established": 1682, "maintained": 2686, "close": 846, "working": 4965, "relationships": 3795, "departments": 1322, "hotel": 2206, "ensure": 1646, "maximum": 2825, "operation": 3156, "productivity": 3539, "morale": 2971, "guest": 2103, "handled": 2120, "daily": 1238, "operations": 3158, "reported": 3822, "directly": 1427, "corporate": 1106, "office": 3111, "hired": 2179, "staff": 4307, "overall": 3212, "objectives": 3089, "goals": 2054, "emphasis": 1588, "high": 2155, "public": 3637, "local": 2640, "businesses": 667, "chamber": 765, "commerce": 897, "executive": 1743, "support": 4509, "jul": 2478, "provided": 3625, "various": 4814, "department": 1320, "heads": 2135, "end": 1610, "friendly": 1990, "efficient": 1562, "ensured": 1652, "second": 4058, "delivery": 1307, "interactions": 2382, "potential": 3429, "clients": 840, "owner": 3223, "partner": 3261, "price": 3479, "integrity": 2374, "coordinator": 1099, "aug": 483, "business": 643, "administration": 225, "college": 883, "school": 4026, "diploma": 1418, "prep": 3450, "studies": 4449, "senior": 4096, "awarded": 512, "american": 311, "scholarship": 4025, "ads": 246, "layout": 2545, "presentations": 3465, "summary dedicated": 4480, "customer service": 1228, "service manager": 4125, "15 years": 39, "years experience": 4994, "service management": 4124, "customer focused": 1212, "customer satisfaction": 1227, "team management": 4568, "management marketing": 2725, "conflict resolution": 1011, "training development": 4685, "multi tasker": 2997, "client relations": 833, "customer loyalty": 1216, "general manager": 2032, "service sales": 4131, "sales strategies": 3988, "inventory control": 2423, "loss prevention": 2660, "time management": 4646, "management leadership": 2724, "experience hr": 1779, "current company": 1199, "company city": 921, "labor relations": 2515, "performance reviews": 3309, "employee relations": 1597, "marketing collateral": 2785, "trade shows": 4671, "company website": 934, "marketing strategies": 2797, "dec company": 1281, "medical billing": 2852, "analytical skills": 322, "computer skills": 975, "medical terminology": 2855, "data analysis": 1249, "state performed": 4363, "duties including": 1519, "including limited": 2278, "financial management": 1891, "management accounting": 2712, "human resources": 2225, "established maintained": 1683, "working relationships": 4968, "daily operations": 1242, "hired trained": 2180, "trained staff": 4680, "marketing advertising": 2782, "public relations": 3639, "chamber commerce": 766, "jun company": 2483, "state provided": 4369, "customer issues": 1215, "company policies": 929, "service delivery": 4120, "potential clients": 3430, "office manager": 3116, "jul company": 2479, "state education": 4350, "business administration": 644, "college city": 884, "state business": 4339, "high school": 2163, "school diploma": 4029, "skills accounting": 4200, "clients customer": 841, "service data": 4119, "marketing marketing": 2790, "personnel policies": 3330, "versatile": 4837, "professional": 3542, "background": 524, "communications": 911, "technology": 4589, "communication": 909, "group": 2095, "policy": 3405, "changes": 771, "standard": 4322, "work": 4944, "job": 2466, "aids": 287, "create": 1156, "comprehensive": 967, "new": 3039, "employees": 1599, "contractors": 1071, "audited": 478, "postings": 3427, "old": 3138, "hold": 2189, "draft": 1493, "positions": 3417, "union": 4749, "hourly": 2209, "non": 3064, "salary": 3961, "checks": 786, "drug": 1512, "conducted": 992, "monthly": 2964, "hire": 2177, "units": 4754, "served": 4112, "link": 2618, "managers": 2753, "vendors": 4827, "handling": 2121, "questions": 3682, "resolving": 3870, "provide": 3621, "real": 3713, "process": 3511, "improvement": 2265, "feedback": 1860, "key": 2492, "metrics": 2900, "initiatives": 2324, "successfully": 4472, "sharepoint": 4154, "site": 4187, "unit": 4751, "project": 3573, "rfp": 3919, "check": 782, "screen": 4044, "vendor": 4824, "05": 13, "op": 3144, "posted": 3425, "articles": 404, "updates": 4767, "graphics": 2082, "visual": 4860, "researched": 3854, "drafted": 1494, "feature": 1849, "stories": 4407, "promote": 3586, "edited": 1535, "developed": 1370, "content": 1052, "quarterly": 3679, "published": 3644, "newsletter": 3059, "internal": 2395, "external": 1804, "events": 1705, "collaborated": 871, "professionals": 3552, "determine": 1363, "needs": 3022, "materials": 2811, "web": 4893, "digital": 1410, "lead": 2547, "product": 3526, "software": 4230, "launches": 2540, "asset": 424, "tool": 4656, "calendar": 680, "approval": 375, "alignment": 297, "guidelines": 2110, "branding": 610, "timely": 4649, "solutions": 4241, "story": 4408, "board": 590, "produced": 3523, "video": 4845, "annual": 333, "hands": 2122, "meeting": 2866, "01": 3, "relationship": 3792, "partnered": 3262, "manage": 2705, "coordinated": 1095, "pre": 3444, "post": 3424, "campaigns": 692, "generate": 2036, "ordered": 3175, "advisors": 259, "improved": 2264, "administered": 223, "modified": 2952, "increase": 2287, "awareness": 514, "preparing": 3458, "promotional": 3590, "publications": 3642, "material": 2810, "supervised": 4495, "distribution": 1463, "quality": 3666, "output": 3205, "brochures": 618, "products": 3540, "graphic": 2079, "designers": 1348, "tracking": 4669, "leads": 2559, "appointments": 367, "10": 25, "head": 2133, "teller": 4600, "received": 3721, "audit": 477, "score": 4042, "100": 28, "audits": 482, "atm": 459, "machines": 2676, "educated": 1540, "variety": 4813, "retail": 3902, "available": 505, "credit": 1169, "options": 3170, "consistently": 1023, "met": 2891, "exceeded": 1713, "promoted": 3587, "maintaining": 2692, "brand": 608, "identity": 2240, "implemented": 2257, "achieve": 166, "exceed": 1712, "organized": 3185, "sponsored": 4291, "campus": 693, "resulting": 3897, "increased": 2290, "coached": 859, "peers": 3296, "proper": 3597, "use": 4783, "improve": 2263, "flow": 1930, "efficiency": 1561, "utilized": 4795, "sell": 4086, "based": 548, "individual": 2302, "grand": 2076, "opening": 3148, "branch": 605, "locations": 2646, "producer": 3524, "exchange": 1737, "planned": 3376, "executed": 1740, "event": 1702, "focusing": 1940, "creative": 1164, "growth": 2100, "industry": 2308, "opportunities": 3164, "come": 891, "panel": 3240, "addressed": 208, "topics": 4659, "answer": 339, "session": 4140, "approximately": 379, "following": 1943, "guests": 2105, "engage": 1621, "networking": 3036, "reception": 3723, "master": 2803, "arts": 408, "heart": 2146, "university": 4755, "bachelor": 518, "western": 4916, "adobe": 239, "photoshop": 3349, "adp": 245, "care": 708, "final": 1879, "cut": 1235, "pro": 3500, "illustrator": 2246, "indesign": 2296, "innovation": 2326, "lotus": 2663, "notes": 3070, "microsoft": 2907, "recruitment": 3753, "experience current": 1776, "state managed": 4362, "training program": 4688, "new employees": 3047, "background checks": 525, "new hire": 3049, "business units": 666, "related issues": 3787, "real time": 3715, "process improvement": 3514, "business unit": 665, "project manager": 3576, "marketing communications": 2786, "internal external": 2398, "web design": 4896, "product service": 3535, "asset management": 425, "specialist company": 4272, "marketing campaigns": 2784, "new business": 3041, "sales teams": 3992, "marketing programs": 2794, "high quality": 2162, "marketing materials": 2791, "promotional materials": 3591, "internal audit": 2396, "met exceeded": 2892, "sales goals": 3971, "products services": 3541, "brand awareness": 609, "work flow": 4950, "product knowledge": 3529, "state planned": 4364, "planned executed": 3377, "education master": 1545, "master arts": 2804, "university city": 4757, "state bachelor": 4338, "bachelor arts": 519, "state university": 4378, "state skills": 4375, "skills adobe": 4203, "adobe photoshop": 243, "customer care": 1208, "lotus notes": 2664, "microsoft office": 2912, "project management": 3575, "employee development": 1592, "director": 1428, "20": 47, "recruiting": 3752, "plus": 3393, "hris": 2221, "maintenance": 2694, "fmla": 1937, "benefit": 565, "institute": 2348, "outcomes": 3196, "memberships": 2873, "member": 2870, "shrm": 4175, "president": 3469, "honor": 2196, "roll": 3935, "dean": 1276, "student": 4444, "liaison": 2599, "production": 3536, "awards": 513, "recognition": 3728, "outstanding": 3210, "travel": 4707, "tourism": 4664, "additional": 204, "information": 2311, "leading": 2558, "change": 767, "instrumental": 2363, "implementation": 2254, "retention": 3905, "research": 3848, "involving": 2440, "survey": 4524, "analyzing": 326, "results": 3898, "surveys": 4525, "present": 3462, "help": 2150, "retain": 3904, "qualified": 3665, "talent": 4539, "federal": 1856, "security": 4070, "joint": 2472, "headquarters": 2134, "developing": 1378, "processes": 3518, "position": 3415, "held": 2149, "requirements": 3843, "able": 107, "produce": 3522, "man": 2704, "hours": 2210, "responsible": 3889, "implement": 2253, "database": 1255, "contact": 1048, "active": 184, "databases": 1257, "usage": 4781, "budget": 623, "turnover": 4731, "reports": 3826, "field": 1869, "took": 4655, "initiative": 2323, "creating": 1162, "receive": 3720, "respond": 3880, "requests": 3839, "promoting": 3588, "facility": 1823, "resource": 3872, "reduced": 3757, "contract": 1064, "costs": 1128, "nursing": 3083, "unique": 4750, "pay": 3281, "structure": 4441, "utilization": 4793, "continually": 1055, "outside": 3208, "box": 603, "resolve": 3864, "environment": 1666, "hiring": 2182, "firm": 1909, "resulted": 3896, "increasing": 2293, "transferred": 4696, "location": 2645, "09": 23, "agency": 271, "processing": 3520, "oversaw": 3214, "taking": 4538, "role": 3933, "physician": 3354, "maintain": 2684, "authored": 490, "handbook": 2118, "coaching": 861, "supervisors": 4500, "depth": 1331, "legal": 2580, "day": 1262, "reducing": 3758, "risks": 3927, "ensuring": 1654, "regulatory": 3781, "compliance": 958, "evaluated": 1698, "recommend": 3731, "04": 11, "supervisory": 4501, "automation": 501, "directed": 1423, "classified": 814, "resolved": 3868, "routine": 3943, "associated": 450, "documents": 1479, "approved": 378, "wage": 4879, "individuals": 2305, "minimum": 2930, "rate": 3703, "significant": 4180, "descriptions": 1334, "determined": 1364, "range": 3697, "consulted": 1043, "military": 2923, "order": 3174, "technical": 4578, "common": 904, "sense": 4101, "guidance": 2107, "properly": 3599, "addressing": 210, "sensitive": 4102, "complex": 956, "aided": 286, "achieving": 171, "changing": 772, "innovative": 2327, "ideas": 2234, "staffing": 4315, "representative": 3830, "negotiations": 3030, "sr": 4305, "recruiter": 3751, "06": 15, "agents": 274, "needed": 3021, "placement": 3372, "cover": 1147, "set": 4142, "facilitated": 1818, "manpower": 2759, "planning": 3380, "career": 709, "statutory": 4393, "regulations": 3780, "person": 3319, "mid": 2918, "level": 2589, "03": 9, "02": 7, "ground": 2094, "monitoring": 2960, "source": 4250, "appraisals": 369, "increases": 2292, "corrective": 1115, "actions": 183, "osha": 3192, "degree": 1299, "united": 4752, "states": 4385, "credits": 1173, "earned": 1525, "semester": 4090, "science": 4032, "honors": 2198, "ambassador": 308, "association": 452, "desktop": 1355, "publishing": 3646, "productions": 3537, "workers": 4960, "suite": 4476, "access": 117, "excel": 1716, "publisher": 3645, "ms": 2986, "word": 4939, "express": 1796, "strategic": 4409, "20 years": 48, "executive management": 1748, "outstanding customer": 3211, "additional information": 205, "development implementation": 1384, "policies procedures": 3402, "budget management": 626, "requests information": 3840, "human resource": 2224, "resolve issues": 3866, "work environment": 4947, "state developed": 4348, "developed new": 1375, "payroll processing": 3290, "implementation new": 2255, "management team": 2741, "performance management": 3308, "depth knowledge": 1332, "day day": 1263, "regulatory compliance": 3782, "employee benefits": 1591, "09 company": 24, "provide technical": 3624, "administration management": 229, "hr manager": 2219, "06 company": 16, "state created": 4345, "senior management": 4100, "quality control": 3668, "career development": 710, "development training": 1393, "training staff": 4691, "compensation benefits": 938, "local state": 2642, "state federal": 4351, "level management": 2591, "management staff": 2738, "02 company": 8, "staffing needs": 4316, "corrective actions": 1117, "education training": 1548, "information management": 2313, "management systems": 2740, "state united": 4377, "united states": 4753, "bachelor science": 522, "activities honors": 189, "health care": 2137, "desktop publishing": 1356, "database management": 1256, "workers compensation": 4961, "access excel": 118, "excel microsoft": 1718, "ms word": 2992, "strategic planning": 4412, "driven": 1506, "dynamic": 1521, "expertise": 1788, "motivated": 2976, "contribute": 1074, "success": 4470, "solid": 4238, "player": 3389, "proven": 3618, "ability": 105, "establish": 1681, "rapport": 3702, "type": 4737, "50": 87, "wpm": 4978, "touch": 4662, "outlook": 3202, "powerpoint": 3434, "telephone": 4595, "inquiries": 2331, "excellent": 1727, "primary": 3483, "focus": 1938, "inbound": 2268, "outbound": 3193, "center": 745, "oral": 3172, "written": 4983, "presentation": 3463, "seasoned": 4056, "oct": 3101, "email": 1581, "emails": 1583, "initial": 2320, "point": 3396, "practices": 3443, "helped": 2152, "answering": 342, "issue": 2447, "routing": 3945, "recorded": 3743, "tracked": 4668, "case": 722, "documenting": 1478, "details": 1361, "complaints": 949, "comments": 896, "taken": 4537, "feb": 1852, "filing": 1876, "methods": 2897, "short": 4171, "term": 4608, "disability": 1436, "respective": 3879, "global": 2050, "clientele": 839, "departmental": 1321, "people": 3298, "communicated": 907, "resolutions": 3863, "queries": 3681, "shift": 4160, "answered": 341, "calls": 686, "san": 4001, "surrounding": 4523, "areas": 394, "adhering": 216, "books": 600, "correct": 1112, "contacted": 1049, "certificate": 751, "completion": 955, "texas": 4622, "extension": 1798, "specialist summary": 4273, "team player": 4573, "proven ability": 3619, "word excel": 4940, "excel access": 1717, "outlook powerpoint": 3203, "personnel management": 3329, "excellent customer": 1729, "service skills": 4132, "quality customer": 3669, "inbound outbound": 2269, "oral written": 3173, "oct company": 3102, "point contact": 3397, "answer questions": 340, "hr policies": 2220, "case management": 723, "maintained records": 2691, "customer interactions": 1214, "service representative": 4129, "feb company": 1853, "state maintained": 4360, "developed implemented": 1372, "short term": 4173, "mar company": 2767, "state answered": 4334, "staff ensure": 4310, "access microsoft": 119, "microsoft excel": 2910, "microsoft outlook": 2913, "microsoft powerpoint": 2914, "powerpoint microsoft": 3435, "microsoft word": 2917, "skill": 4194, "startup": 4332, "organization": 3179, "law": 2541, "ada": 196, "mediation": 2849, "advocacy": 261, "unemployment": 4748, "worker": 4959, "orientation": 3187, "boarding": 593, "technologies": 4588, "applications": 361, "kronos": 2509, "visio": 4854, "jan": 2455, "function": 1997, "cycle": 1237, "fulfillment": 1994, "foster": 1972, "oriented": 3189, "culture": 1194, "continuous": 1061, "applicable": 356, "identify": 2238, "concerns": 985, "effective": 1554, "sources": 4252, "levels": 2593, "assist": 433, "creation": 1163, "review": 3912, "insure": 2367, "regional": 3769, "included": 2275, "feel": 1862, "like": 2614, "essential": 1679, "managing": 2755, "recruit": 3749, "associates": 451, "includes": 2276, "cases": 724, "vision": 4855, "successful": 4471, "expected": 1767, "month": 2962, "aligned": 296, "start": 4328, "efforts": 1565, "27": 75, "files": 1875, "providing": 3634, "direction": 1425, "continued": 1057, "grow": 2098, "leaders": 2551, "peak": 3293, "season": 4054, "worked": 4955, "temporary": 4603, "agencies": 270, "volume": 4870, "consisted": 1020, "total": 4660, "delivering": 1306, "million": 2924, "black": 586, "influence": 2309, "strategy": 4417, "execute": 1739, "tactical": 4535, "consistency": 1021, "multiple": 3000, "interact": 2378, "exempt": 1754, "functional": 1998, "groups": 2097, "trends": 4716, "developments": 1395, "accurate": 163, "core": 1103, "values": 4809, "workforce": 4964, "coach": 858, "line": 2616, "best": 568, "dealing": 1274, "relation": 3789, "attendance": 464, "behavior": 560, "conduct": 991, "fun": 1996, "confidentiality": 1001, "accordance": 127, "expectations": 1766, "look": 2655, "ways": 4891, "communicate": 905, "impact": 2252, "situation": 4189, "compliant": 959, "separate": 4107, "community": 914, "profit": 3558, "played": 3388, "private": 3499, "structured": 4442, "structures": 4443, "packages": 3233, "incentive": 2270, "contracts": 1072, "fostered": 1973, "teamwork": 4576, "open": 3145, "door": 1490, "positive": 3418, "85": 98, "rating": 3705, "negotiated": 3027, "offers": 3110, "physicians": 3355, "ceo": 749, "cfo": 758, "wrote": 4986, "manual": 2760, "covering": 1149, "disciplinary": 1441, "code": 863, "presented": 3466, "directors": 1433, "introduced": 2418, "formal": 1962, "categories": 738, "interviewed": 2414, "nation": 3007, "largest": 2530, "small": 4217, "broad": 616, "generalist": 2035, "functions": 2003, "administering": 224, "overseeing": 3217, "action": 181, "interviewing": 2415, "workshops": 4973, "sessions": 4141, "contributed": 1075, "sound": 4249, "decisions": 1287, "ft": 1991, "art": 403, "400": 85, "year": 4989, "special": 4266, "banquets": 544, "investigated": 2428, "sexual": 4150, "shifts": 4161, "affiliations": 266, "society": 4227, "valley": 4804, "decision": 1284, "making": 2701, "win": 4923, "negotiating": 3028, "problem": 3503, "solving": 4245, "quantitative": 3675, "skill highlights": 4195, "benefits administration": 567, "management organizational": 2726, "organizational development": 3181, "ms office": 2989, "office word": 3127, "excel powerpoint": 1723, "professional experience": 3545, "state manage": 4361, "data center": 1250, "continuous improvement": 1062, "team work": 4574, "high performance": 2159, "resource management": 3873, "staff management": 4311, "jan jan": 2457, "jan company": 2456, "develop implement": 1367, "policies processes": 3403, "business partner": 657, "day operations": 1264, "laws regulations": 2544, "leadership development": 2554, "best practices": 569, "federal state": 1857, "executive team": 1751, "non profit": 3065, "responsible maintaining": 3890, "board directors": 591, "job descriptions": 2467, "hr generalist": 2218, "functions including": 2004, "support staff": 4512, "programs including": 3569, "special events": 4268, "education bachelor": 1543, "bachelor business": 520, "professional affiliations": 3543, "decision making": 1286, "management human": 2720, "management reporting": 2733, "excel ms": 1719, "office office": 3119, "office outlook": 3121, "problem solving": 3506, "management quality": 2732, "staff development": 4309, "strategy strategic": 4418, "administrative": 230, "excels": 1732, "prioritizing": 3496, "completing": 954, "tasks": 4548, "simultaneously": 4185, "seeking": 4073, "responsibility": 3888, "authority": 491, "proficiency": 3553, "spreadsheets": 4298, "meticulous": 2898, "attention": 468, "self": 4082, "mature": 2821, "starter": 4330, "08": 20, "visa": 4852, "faculty": 1828, "enhanced": 1639, "operational": 3157, "tools": 4658, "authorization": 492, "times": 4652, "30": 78, "percent": 3301, "prepared": 3454, "electronic": 1571, "filed": 1874, "adhere": 213, "distributed": 1462, "bi": 574, "11": 31, "advice": 254, "students": 4446, "interpreting": 2410, "thoroughly": 4635, "highly": 2170, "confidential": 1000, "identified": 2236, "designated": 1341, "officer": 3128, "foreign": 1959, "obtaining": 3099, "status": 4391, "volunteers": 4874, "international": 2399, "advisor": 258, "secretary": 4062, "agendas": 272, "supplied": 4502, "advance": 249, "follow": 1941, "conferences": 997, "receptionist": 3724, "area": 391, "greeting": 2091, "visitors": 4857, "responding": 3882, "file": 1873, "paper": 3242, "conference": 995, "rooms": 3937, "correspondence": 1119, "incoming": 2281, "mail": 2680, "copies": 1101, "sent": 4103, "faxes": 1846, "outgoing": 3198, "scanned": 4016, "equipment": 1670, "paralegal": 3245, "ba": 517, "justice": 2488, "psychology": 3636, "county": 1141, "essentials": 1680, "2013": 63, "critical": 1180, "selection": 4080, "establishing": 1684, "competencies": 939, "york": 4996, "recognized": 3730, "presenter": 3467, "national": 3008, "acting": 180, "2000": 50, "calm": 688, "approach": 371, "number": 3078, "activity": 191, "style": 4453, "works": 4971, "evaluation": 1700, "contractual": 1073, "task": 4545, "operate": 3151, "merit": 2888, "proposal": 3603, "thank": 4624, "contributions": 1078, "make": 2697, "valued": 4808, "personable": 3320, "model": 2946, "arrangements": 400, "administrative assistant": 231, "multiple tasks": 3002, "highlights microsoft": 2169, "office proficiency": 3123, "excel spreadsheets": 1724, "meticulous attention": 2899, "results oriented": 3900, "self directed": 4083, "management professional": 2729, "self starter": 4085, "administrative support": 233, "faculty staff": 1829, "coordinator company": 1100, "training programs": 4689, "area including": 392, "telephone person": 4597, "incoming mail": 2283, "incoming outgoing": 2284, "outgoing correspondence": 3199, "powerpoint presentations": 3438, "business development": 647, "managed daily": 2709, "office operations": 3120, "resources management": 3877, "new york": 3056, "institute technology": 2350, "technology city": 4590, "national association": 3009, "skills administrative": 4202, "powerpoint word": 3439, "management processes": 2728, "travel arrangements": 4708, "annual reports": 335, "extensive": 1799, "implementing": 2259, "demonstrated": 1315, "writing": 4981, "manuals": 2761, "coordinating": 1097, "online": 3141, "prepare": 3452, "teacher": 4557, "using": 4789, "enjoy": 1643, "ongoing": 3140, "workplace": 4970, "advertisements": 252, "speaker": 4263, "days": 1265, "houston": 2215, "perform": 3304, "coordination": 1098, "series": 4110, "independent": 2294, "judgment": 2477, "wide": 4919, "supervision": 4497, "teaching": 4561, "english": 1635, "languages": 2523, "exit": 1760, "interviews": 2416, "develops": 1396, "problems": 3507, "coordinate": 1094, "retirement": 3906, "scheduling": 4023, "schedules": 4022, "newsletters": 3060, "effectively": 1556, "charge": 777, "prioritize": 3494, "assigned": 428, "vice": 4843, "iii": 2243, "newly": 3057, "peoplesoft": 3300, "module": 2954, "250": 73, "keeping": 2490, "conducting": 993, "translated": 4700, "spanish": 4260, "course": 1142, "specific": 4279, "restaurant": 3893, "encouraged": 1608, "bar": 545, "kitchen": 2497, "food": 1944, "bs": 622, "sociology": 4228, "north": 3066, "higher": 2165, "membership": 2872, "girls": 2045, "manager summary": 2751, "administrative duties": 232, "professional development": 3544, "exit interviews": 1761, "resolving problems": 3871, "new employee": 3046, "employee orientation": 1595, "vice president": 4844, "01 company": 5, "state responsible": 4371, "training new": 4687, "guest satisfaction": 2104, "hiring training": 2184, "kitchen staff": 2499, "building": 637, "supporting": 4515, "organizations": 3183, "bringing": 615, "room": 3936, "strong": 4430, "improvements": 2266, "drive": 1505, "goal": 2051, "attainment": 462, "loyal": 2668, "knowledgeable": 2505, "backup": 527, "bookkeeping": 599, "competitive": 943, "enforcement": 1620, "letters": 2588, "market": 2774, "history": 2186, "mission": 2938, "workflows": 4963, "continuously": 1063, "improving": 2267, "sourcing": 4253, "built": 641, "allowing": 304, "period": 3314, "cost": 1120, "average": 506, "achieved": 167, "placed": 3371, "broker": 619, "advised": 256, "aspects": 415, "disputes": 1459, "proactive": 3501, "offered": 3107, "fair": 1832, "enforced": 1619, "relating": 3788, "phases": 3339, "acted": 178, "lines": 2617, "middle": 2919, "operating": 3153, "monitored": 2959, "rewards": 3917, "evaluations": 1701, "specifications": 4281, "description": 1333, "closely": 848, "brokers": 620, "minimize": 2929, "district": 1465, "led": 2574, "55": 89, "members": 2871, "orientations": 3188, "carriers": 721, "candidates": 697, "officials": 3132, "previous": 3477, "employers": 1601, "references": 3761, "regular": 3777, "overtime": 3220, "updated": 4766, "committee": 902, "supported": 4514, "renewal": 3808, "extended": 1797, "selected": 4078, "completeness": 952, "verifying": 4836, "collecting": 880, "investigations": 2430, "processed": 3517, "sorting": 4248, "cleaning": 820, "recruited": 3750, "screened": 4045, "criminal": 1176, "entered": 1656, "subcontractor": 4456, "central": 748, "accurately": 165, "inquires": 2330, "subcontractors": 4457, "manner": 2758, "corrected": 1113, "offer": 3106, "phoenix": 3342, "learning": 2568, "mba": 2826, "manager professional": 2750, "professional summary": 3548, "process improvements": 3515, "law enforcement": 2542, "team building": 4563, "payroll personnel": 3289, "vendor management": 4825, "year end": 4990, "work history": 4951, "company policy": 930, "policy procedures": 3406, "05 company": 14, "acted liaison": 179, "standard operating": 4323, "operating procedures": 3154, "safety training": 3958, "year year": 4991, "state led": 4358, "staff members": 4313, "resolve problems": 3867, "08 company": 21, "state conducted": 4343, "process new": 3516, "new hires": 3050, "timely manner": 4651, "science business": 4034, "business management": 650, "management university": 2743, "university phoenix": 4760, "phoenix city": 3343, "possess": 3422, "classification": 813, "documented": 1477, "abilities": 104, "match": 2808, "candidate": 696, "reference": 3760, "competency": 940, "nurses": 3082, "mechanical": 2840, "machine": 2674, "operators": 3163, "civil": 806, "engineers": 1633, "jobs": 2470, "18": 43, "000": 1, "determining": 1365, "consultation": 1041, "class": 811, "roles": 3934, "necessary": 3019, "accomplish": 124, "acquisition": 174, "additionally": 206, "procedural": 3508, "violence": 4848, "negotiation": 3029, "micro": 2905, "soft": 4229, "solve": 4242, "serve": 4111, "agent": 273, "missions": 2939, "negotiate": 3026, "include": 2274, "analyses": 313, "deliver": 1302, "measure": 2832, "monitor": 2958, "qualifications": 3664, "phone": 3344, "recommended": 3734, "applicants": 358, "dates": 1261, "classes": 812, "referred": 3764, "request": 3837, "budgetary": 628, "adjustments": 220, "expanded": 1763, "scope": 4041, "responsibilities": 3885, "percentage": 3302, "requirement": 3842, "prioritized": 3495, "referrals": 3763, "council": 1129, "requested": 3838, "occupational": 3100, "versed": 4838, "upgrades": 4771, "trades": 4672, "institutional": 2352, "oversight": 3219, "12": 33, "analysts": 319, "exceptions": 1735, "reduction": 3759, "force": 1955, "delivered": 1304, "rules": 3947, "assessed": 420, "educational": 1550, "principles": 3485, "major": 2696, "contributor": 1079, "ethical": 1693, "practice": 3442, "trainers": 4682, "language": 2521, "nc": 3017, "goals objectives": 2055, "leadership management": 2555, "employee training": 1598, "market analysis": 2775, "analyst company": 318, "implemented new": 2258, "team lead": 4565, "performance evaluations": 3306, "research development": 3851, "training bachelor": 4684, "clerk": 827, "profitability": 3560, "engagement": 1623, "ethics": 1694, "social": 4223, "diversity": 1467, "connection": 1015, "lean": 2561, "sigma": 4176, "applicant": 357, "onboarding": 3139, "ledger": 2576, "manufacturing": 2763, "projects": 3584, "oversees": 3218, "performs": 3313, "secretarial": 4061, "serves": 4116, "participates": 3256, "setup": 4148, "provider": 3631, "bookkeeper": 598, "provides": 3633, "accounts": 154, "payable": 3282, "clerical": 826, "ii": 2242, "statistical": 4388, "performing": 3312, "receiving": 3722, "arranging": 401, "interpretation": 2408, "invoicing": 2437, "sheets": 4157, "body": 595, "examined": 1710, "learned": 2565, "apply": 364, "starting": 4331, "looking": 2656, "way": 4890, "boost": 601, "reduce": 3756, "avoid": 509, "handle": 2119, "challenging": 764, "blue": 588, "credentials": 1168, "electronics": 1573, "plant": 3383, "updating": 4768, "division": 1468, "chapter": 775, "employee engagement": 1593, "lean sigma": 2563, "general ledger": 2031, "ledger accounting": 2577, "lean manufacturing": 2562, "special projects": 4270, "wide variety": 4921, "duties included": 1518, "high level": 2158, "accounts payable": 156, "conference calls": 996, "bachelor degree": 521, "management skills": 2736, "community college": 915, "project team": 3581, "reporting research": 3824, "diverse": 1466, "growing": 2099, "workload": 4969, "resourceful": 3875, "attitude": 469, "interpersonal": 2404, "ar": 385, "ap": 347, "oracle": 3171, "great": 2084, "quickbooks": 3686, "peachtree": 3292, "sourced": 4251, "finding": 1901, "right": 3921, "matching": 2809, "permanent": 3317, "entering": 1657, "interview": 2413, "compiling": 948, "track": 4666, "test": 4615, "meet": 2861, "administer": 222, "scores": 4043, "given": 2047, "organize": 3184, "promotion": 3589, "explained": 1791, "trainings": 4692, "existing": 1757, "ordering": 3176, "spreadsheet": 4297, "stores": 4406, "card": 706, "involved": 2438, "posting": 3426, "reviewing": 3914, "result": 3895, "device": 1397, "invoices": 2436, "memos": 2874, "returns": 3908, "fees": 1863, "cash": 725, "collection": 881, "invoice": 2435, "payment": 3286, "insured": 2368, "paid": 3237, "reconciliation": 3738, "supplier": 4503, "purchase": 3650, "orders": 3178, "expense": 1770, "electrical": 1568, "balanced": 530, "revenue": 3909, "trip": 4719, "logistics": 2650, "graduation": 2074, "volunteer": 4872, "mentor": 2878, "kids": 2495, "young": 4997, "adults": 248, "succeed": 4469, "seminar": 4092, "smart": 4220, "summary highly": 4482, "highly motivated": 2172, "seeking position": 4074, "professional years": 3549, "results driven": 3899, "strong communication": 4432, "interpersonal skills": 2406, "office suite": 3125, "communication skills": 910, "office management": 3115, "management customer": 2717, "new existing": 3048, "rules regulations": 3948, "representative company": 3831, "accurate timely": 164, "timely accurate": 4650, "purchase orders": 3652, "expense reports": 1771, "assistant company": 437, "ap ar": 348, "service customer": 4118, "practical": 3441, "understanding": 4744, "offering": 3108, "ma": 2671, "managerial": 2752, "tech": 4577, "tooling": 4657, "admin": 221, "report": 3820, "procedure": 3509, "direct": 1420, "standardized": 4324, "need": 3020, "investigation": 2429, "record": 3741, "representing": 3834, "deal": 1271, "maximized": 2823, "film": 1878, "chief": 794, "living": 2633, "abroad": 110, "spectrum": 4284, "date": 1259, "progress": 3570, "fee": 1858, "conducts": 994, "specialty": 4278, "accordingly": 130, "variance": 4810, "compile": 946, "appraisal": 368, "measurement": 2834, "supervise": 4494, "assign": 427, "domestic": 1485, "procurement": 3521, "requisitions": 3847, "approve": 377, "terms": 4613, "conditions": 990, "effort": 1564, "workflow": 4962, "productive": 3538, "assure": 454, "deadlines": 1270, "priorities": 3492, "submissions": 4462, "initiate": 2321, "facilities": 1822, "specialized": 4275, "explain": 1790, "independently": 2295, "responsive": 3892, "formulate": 1966, "assess": 419, "long": 2653, "raise": 3693, "oversee": 3216, "submit": 4463, "relevant": 3799, "matters": 2820, "steel": 4395, "metal": 2893, "cultural": 1193, "usa": 4779, "pm": 3394, "tax": 4550, "iso": 2446, "balance": 528, "kpi": 2507, "place": 3370, "welfare": 4910, "preventive": 3476, "technique": 4585, "package": 3231, "internet": 2401, "good": 2059, "speaking": 4264, "business needs": 651, "areas expertise": 395, "team oriented": 4572, "program development": 3564, "experience company": 1774, "development business": 1382, "business plan": 659, "development manager": 1386, "state general": 4352, "strategic plans": 4413, "company goals": 923, "accordance company": 128, "work closely": 4946, "administrative tasks": 234, "processes procedures": 3519, "questions regarding": 3683, "development management": 1385, "business goals": 648, "short long": 4172, "long term": 2654, "state usa": 4379, "analytical problem": 321, "strategic strategic": 4414, "obtain": 3096, "enhance": 1638, "return": 3907, "continue": 1056, "future": 2011, "motivating": 2978, "better": 571, "ethic": 1692, "professionalism": 3550, "fast": 1842, "paced": 3228, "proficient": 3554, "coaches": 860, "guides": 2111, "ensures": 1653, "recommendations": 3733, "transfer": 4695, "manages": 2754, "setting": 4144, "designs": 1350, "implements": 2260, "interventions": 2412, "experienced": 1784, "completes": 953, "divisions": 1470, "concerning": 984, "researching": 3856, "train": 4676, "executing": 1741, "escalated": 1677, "promptly": 3594, "bank": 533, "controls": 1087, "advise": 255, "home": 2193, "shopping": 4170, "network": 3033, "instructions": 2359, "junior": 2486, "peer": 3295, "act": 177, "recording": 3744, "flight": 1925, "attendant": 465, "ticket": 4638, "numbers": 3079, "meal": 2829, "beverage": 572, "inventories": 2421, "pilot": 3362, "briefings": 613, "st": 4306, "french": 1987, "communicator": 912, "summary obtain": 4483, "obtain position": 3097, "leadership skills": 2556, "ability work": 106, "work team": 4954, "effective communication": 1555, "skills strong": 4212, "strong analytical": 4431, "solving skills": 4246, "strong work": 4439, "work ethic": 4948, "excellent interpersonal": 1730, "organizational skills": 3182, "skills team": 4213, "multiple projects": 3001, "fast paced": 1844, "paced environment": 3229, "word microsoft": 4941, "microsoft access": 2908, "corrective action": 1116, "goal setting": 2053, "operations manager": 3161, "quality improvement": 3670, "customer support": 1230, "manager 10": 2746, "support team": 4513, "team members": 4571, "train new": 4677, "ensure compliance": 1648, "internal controls": 2397, "customer services": 1229, "associate arts": 446, "working knowledge": 4967, "excellent communication": 1728, "skills customer": 4205, "leadership team": 2557, "management project": 2731, "profile": 3556, "allow": 302, "erp": 1674, "as400": 411, "explorer": 1793, "requisition": 3846, "internship": 2403, "sep": 4105, "energy": 1617, "personal": 3321, "beginning": 558, "weekly": 4903, "basis": 551, "representatives": 3832, "vital": 4865, "component": 962, "transaction": 4693, "canada": 694, "sox": 4258, "nov": 3072, "update": 4765, "schedule": 4020, "discipline": 1442, "response": 3883, "requires": 3844, "termination": 4610, "family": 1838, "release": 3797, "familiar": 1835, "investigate": 2427, "consultant": 1037, "injury": 2325, "closed": 847, "carrier": 720, "items": 2452, "openings": 3150, "bachelors": 523, "michigan": 2904, "instructor": 2360, "resident": 3859, "extensive experience": 1800, "high profile": 2161, "created implemented": 1158, "developed executed": 1371, "weekly monthly": 4905, "monthly reports": 2968, "aug company": 484, "weekly basis": 4904, "performance improvement": 3307, "sep company": 4106, "state provide": 4368, "hire orientation": 2178, "education mba": 1547, "board member": 592, "excel outlook": 1721, "screening": 4046, "testing": 4620, "chair": 761, "achievement": 168, "academic": 113, "counselor": 1133, "award": 510, "account": 131, "corporation": 1109, "document": 1474, "january": 2458, "exceptional": 1733, "alternative": 306, "street": 4424, "teachers": 4560, "administrators": 236, "partnerships": 3265, "fairs": 1833, "comply": 961, "schools": 4031, "assists": 443, "projections": 3583, "35": 81, "counsel": 1130, "coverage": 1148, "collaborate": 870, "ad": 194, "maintains": 2693, "panels": 3241, "entire": 1662, "doctors": 1473, "accepted": 116, "identification": 2235, "logs": 2652, "licensing": 2606, "controlling": 1086, "accident": 121, "december": 1282, "secondary": 4059, "november": 3074, "event planning": 1704, "employee month": 1594, "achievement award": 169, "account executive": 132, "quality management": 3671, "management training": 2742, "company january": 924, "january current": 2460, "january january": 2461, "senior leadership": 4098, "hiring managers": 2183, "developed maintained": 1373, "manager city": 2747, "education university": 1549, "school business": 4027, "history company": 2187, "building leadership": 638, "materials meetings": 2812, "auditing": 479, "property": 3601, "vast": 4817, "receivable": 3718, "expert": 1787, "sap": 4005, "enterprise": 1658, "large": 2528, "deposits": 1328, "telecommunication": 4593, "listening": 2624, "energetic": 1616, "courteous": 1146, "demeanor": 1313, "multitasking": 3003, "fax": 1845, "desk": 1354, "identifying": 2239, "quickly": 3687, "gaining": 2016, "trust": 4728, "situations": 4190, "maximize": 2822, "faxing": 1847, "scanning": 4018, "inter": 2377, "errors": 1676, "generating": 2038, "superior": 4492, "computed": 969, "figures": 1872, "rapidly": 3701, "conflicts": 1012, "prevent": 3473, "interface": 2386, "greeted": 2089, "store": 4402, "verify": 4835, "entry": 1665, "missing": 2937, "getting": 2043, "sprint": 4300, "rates": 3704, "calculations": 679, "collected": 879, "charges": 778, "variances": 4812, "07": 17, "enhancements": 1641, "debit": 1278, "vouchers": 4875, "reconciled": 3737, "verified": 4834, "funds": 2009, "balances": 531, "coded": 864, "payments": 3287, "party": 3267, "reserve": 3858, "batch": 553, "verification": 4833, "overhead": 3213, "discrepancies": 1446, "having": 2130, "utilities": 4791, "recipient": 3727, "dedication": 1291, "journal": 2473, "entries": 1664, "apartment": 349, "leasing": 2571, "lake": 2518, "allocated": 300, "outs": 3207, "painting": 3239, "sign": 4177, "bids": 577, "renewals": 3809, "incentives": 2271, "gpa": 2067, "study": 4451, "enrolled": 1644, "95": 100, "risk": 3923, "property management": 3602, "accounts receivable": 157, "customer relations": 1221, "resource planning": 3874, "strong organizational": 4435, "cash check": 726, "skills active": 4201, "active listening": 186, "listening skills": 2625, "high volume": 2164, "answering questions": 344, "monthly quarterly": 2967, "key accounts": 2493, "market research": 2777, "customer needs": 1217, "greeted customers": 2090, "cash credit": 727, "assisted customers": 441, "store operations": 4404, "03 company": 10, "data entry": 1252, "11 company": 32, "accounting software": 152, "researched resolved": 3855, "ledger accounts": 2578, "effectively managed": 1557, "credit card": 1170, "journal entries": 2474, "12 company": 34, "gpa gpa": 2068, "payable accounts": 3283, "environments": 1668, "power": 3431, "share": 4152, "immediate": 2250, "clean": 818, "conversion": 1088, "500": 88, "october": 3103, "july": 2480, "foods": 1953, "integration": 2373, "revised": 3916, "intake": 2369, "defining": 1298, "addition": 203, "utilizing": 4796, "main": 2682, "enhancing": 1642, "involvement": 2439, "letter": 2587, "announcements": 332, "consult": 1036, "illinois": 2245, "claim": 809, "assisting": 442, "preparation": 3451, "hoc": 2188, "february": 1854, "vp": 4876, "analyze": 324, "yearly": 4992, "utilize": 4794, "chicago": 793, "distribute": 1461, "partners": 3263, "confirm": 1008, "payables": 3285, "september": 4108, "sites": 4188, "lists": 2626, "samples": 3999, "run": 3949, "allocation": 301, "format": 1963, "send": 4094, "priority": 3497, "instrument": 2362, "summary experienced": 4481, "ms excel": 2988, "excel word": 1725, "power point": 3432, "company october": 928, "company wide": 935, "ad hoc": 195, "company february": 922, "risk management": 3926, "company september": 931, "monthly sales": 2969, "change management": 768, "confident": 999, "currently": 1201, "cold": 868, "calling": 685, "opportunity": 3165, "outreach": 3206, "child": 795, "input": 2329, "devised": 1399, "employer": 1600, "25": 72, "children": 797, "parents": 3248, "therapist": 4628, "economic": 1530, "backgrounds": 526, "clear": 822, "drafting": 1495, "editing": 1536, "according": 129, "fit": 1914, "eligibility": 1577, "pertaining": 3332, "array": 402, "classroom": 815, "demonstrations": 1318, "adjusted": 218, "image": 2247, "consumer": 1045, "enter": 1655, "efficiently": 1563, "makes": 2700, "forms": 1965, "initiated": 2322, "cooperative": 1093, "supportive": 4516, "collaboratively": 875, "challenges": 763, "encourage": 1607, "discuss": 1447, "discussion": 1448, "anticipated": 346, "inform": 2310, "application": 359, "60": 91, "south": 4256, "carolina": 717, "cpr": 1151, "aid": 284, "finance": 1880, "theory": 4626, "45": 86, "basic": 550, "integrated": 2371, "graduate": 2072, "cum": 1195, "laude": 2537, "pricing": 3481, "hands experience": 2123, "cold calling": 869, "community outreach": 916, "skills microsoft": 4208, "meet needs": 2865, "served liaison": 4113, "duties include": 1517, "state company": 4340, "cpr aid": 1152, "financial accounting": 1884, "marketing management": 2787, "international business": 2400, "information systems": 2315, "administration business": 227, "cum laude": 1196, "budget business": 625, "finance financial": 1881, "meetings access": 2868, "negotiator": 3031, "fluent": 1932, "offices": 3130, "dispute": 1458, "enrollment": 1645, "build": 635, "informed": 2317, "detailed": 1360, "customized": 1234, "mentoring": 2880, "clinical": 844, "wellness": 4911, "functioning": 2002, "moved": 2982, "closing": 849, "reimbursement": 3784, "1000": 30, "protocols": 3615, "merchandise": 2885, "display": 1454, "assembled": 416, "properties": 3600, "displays": 1456, "windows": 4925, "floor": 1926, "competition": 942, "competitor": 944, "gathering": 2025, "prices": 3480, "masters": 2807, "june": 2484, "liberal": 2600, "event management": 1703, "january company": 2459, "strong relationships": 4437, "level customer": 2590, "maintained accurate": 2687, "management process": 2727, "store manager": 4403, "manager january": 2749, "company state": 933, "helped customers": 2153, "providing information": 3635, "sales floor": 3969, "education masters": 1546, "liberal arts": 2601, "consulting": 1044, "facets": 1816, "affairs": 265, "counseling": 1132, "connect": 1014, "optimized": 3169, "differentiated": 1408, "optimization": 3167, "portal": 3411, "collaborative": 874, "philosophy": 3341, "calculation": 678, "collaboration": 873, "meets": 2869, "educate": 1539, "recognize": 3729, "measures": 2836, "onsite": 3143, "offshore": 3133, "relocation": 3802, "mis": 2936, "enable": 1604, "running": 3950, "educating": 1541, "reinforcement": 3785, "engaged": 1622, "referral": 3762, "attending": 467, "drove": 1511, "assignments": 432, "motivate": 2975, "interests": 2385, "computers": 978, "spot": 4296, "driving": 1510, "strengths": 4427, "summary years": 4486, "life cycle": 2608, "analysis reporting": 316, "end end": 1613, "social media": 4224, "grammar": 2075, "solver": 4244, "exemplary": 1753, "extra": 1807, "2009": 59, "april": 382, "purposes": 3658, "gain": 2014, "cards": 707, "august": 485, "neat": 3018, "fashion": 1841, "chart": 779, "buy": 669, "mentored": 2879, "menu": 2881, "ingredients": 2319, "serving": 4139, "appropriately": 374, "suggested": 4474, "beverages": 573, "selections": 4081, "dietary": 1406, "regularly": 3778, "checked": 783, "drawer": 1497, "adhered": 214, "stocked": 4399, "agricultural": 281, "strong interpersonal": 4433, "strong problem": 4436, "problem solver": 3505, "service team": 4135, "october company": 3104, "state served": 4374, "maintained date": 2689, "august company": 486, "telephone calls": 4596, "december company": 1283, "state assisted": 4336, "maintained knowledge": 2690, "knowledge current": 2503, "menu items": 2883, "north carolina": 3068, "skills business": 4204, "client clients": 830, "office powerpoint": 3122, "reputation": 3836, "proactively": 3502, "communicating": 908, "francisco": 1980, "bay": 554, "leverage": 2594, "value": 4807, "lifecycle": 2609, "selecting": 4079, "platforms": 3386, "interns": 2402, "different": 1407, "grew": 2092, "gained": 2015, "intern": 2393, "actively": 187, "participants": 3253, "framework": 1978, "deployment": 1326, "tested": 4619, "app": 351, "hand": 2116, "smooth": 4221, "transition": 4699, "parent": 3247, "guided": 2109, "tours": 4665, "inclusion": 2279, "america": 310, "pipeline": 3364, "target": 4541, "markets": 2800, "stakeholders": 4320, "targets": 4544, "targeted": 4542, "align": 295, "attend": 463, "virtual": 4850, "expenses": 1772, "roi": 3932, "forward": 1971, "investment": 2431, "graduated": 2073, "summa": 4477, "delta": 1309, "goal oriented": 2052, "san francisco": 4003, "public speaking": 3640, "media marketing": 2845, "business partners": 658, "media strategy": 2848, "state develop": 4347, "north america": 3067, "summa cum": 4478, "thinker": 4632, "advisory": 260, "delegated": 1301, "assessments": 423, "inspector": 2341, "subject": 4458, "matter": 2818, "acquisitions": 175, "participate": 3254, "2016": 66, "correctly": 1118, "guide": 2108, "specialists": 4274, "evaluating": 1699, "stand": 4321, "desired": 1352, "audiences": 475, "voice": 4868, "companies": 919, "visibility": 4853, "resume": 3901, "2014": 64, "participated": 3255, "mass": 2802, "2015": 65, "launched": 2539, "1st": 46, "spend": 4288, "19": 44, "2nd": 77, "quarter": 3678, "capital": 702, "twitter": 4735, "expand": 1762, "means": 2831, "learn": 2564, "entities": 1663, "important": 2262, "country": 1139, "possible": 3423, "developmental": 1394, "latest": 2535, "demand": 1310, "streamlining": 4422, "magazine": 2677, "sop": 4247, "annually": 338, "brought": 621, "list": 2622, "16": 41, "did": 1404, "flexible": 1924, "later": 2534, "grade": 2069, "broadcast": 617, "journalism": 2475, "alpha": 305, "kappa": 2489, "defense": 1294, "thinking": 4633, "management reports": 2734, "senior level": 4099, "subject matter": 4459, "matter expert": 2819, "program management": 3565, "created maintained": 1159, "facebook twitter": 1815, "technical support": 4582, "honor society": 2197, "recommending": 3735, "committees": 903, "light": 2612, "duty": 1520, "contractor": 1070, "mapping": 2764, "upper": 4775, "supply": 4507, "blood": 587, "centers": 747, "numerous": 3080, "managing multiple": 2757, "development new": 1388, "certified professional": 756, "employee performance": 1596, "sales staff": 3987, "upper management": 4776, "provided training": 3630, "management city": 2714, "bilingual": 579, "contribution": 1077, "agreements": 280, "budgets": 632, "helping": 2154, "regards": 3767,